Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Thus any instance of the Task class can call this method with the . method call operator.
ja: したがってTaskクラスのどのインスタンスでも.メソッド呼び出し演算子でこのメソッドを呼ぶことができます。

source: Thus the iteration construct calls the .perform() method on every Task object in the @!dependencies attribute of the current invocant.
ja: したがって、繰り返し構造は.perform()メソッドを@!dependencies属性の全てのTaskオブジェクトを現在のインボカントに呼び出します。

source: To access the non-captured parts too, use $/.chunks instead.
ja: キャプチャーされなかった部分にもアクセスするために、代わりに$/.chunksを使います。

source: To apply a modifier to more than just one character or character class, group items with square brackets:
ja: 修飾子をちょうど1つ以上の文字または文字クラスに適用するために、スクエアブラケットで項目をグループにしてください：

source: To coerce your return value, use a coercion type:
ja: 戻り値を強制するために、型の自動変換を使ってください：

source: To create a single task with no dependencies, write:
ja: 従属物なしでシングルタスクを作るためには次のように書きます：

source: To define your own custom character classes, listing the appropriate characters inside nested angle and square brackets <[ ... ]>:
ja: 適切な文字を入れ子になったアングルと角型ブラケット<[ ... ]>にリストして、あなた自身のカスタム文字クラスを定義します：

source: To distinguish the prefix operator - from the infix operator -, the Perl 6 parser always keeps track of whether it expects an infix operator or a term.
ja: 接頭辞-と接中辞-を識別するため、Perl 6パーサーは接中辞演算子または項を期待するかどうかにかかわらず、常に経過を追跡します。

source: To do this, precede the name of the parameter with a colon:
ja: これをするには、パラメータの名前の前にコロンをつけます：

source: To do this, use the \(...) syntax.
ja: これをするために\(...)構文を使ってください。

source: To format a hash value or list of pairs, include formats for both key and value in the first string: .fmt('%s: %s', "\n").
ja: ハッシュ値かペアのリストをフォーマットするために、キーと値の両方のフォーマットを最初の文字列に含めてください：.fmt('%s: %s', "\n")

source: To format an array value separated by commas, supply a second argument: .fmt('%03d', ', ').
ja: 配列値をコンマで区切るには第二の引数を与えてください：.fmt('%03d', ', ')

source: To get a formatted representation of any scalar value, use the .fmt('%03d') method to do an implicit sprintf on the value.
ja: スカラー値のフォーマットされた表現を得るために、値上で暗黙のsprintfを行う.fmt('%03d')メソッドを使ってください。

source: To get the number of elements in an array, use the .elems method.
ja: 配列の要素数を得るために.elemsメソッドを使ってください。

source: To hide all candidates of a multi and replace them by another sub, declare it as only sub YourSub.
ja: マルチのすべての候補を隠して、それらを別のサブと取り替えるために、それをonly sub YourSubと宣言してください。

source: To ignore all unhandled exceptions, use an empty default case.
ja: 全てのハンドルされない例外を無視するために、空のdefaultケースを使え。

source: To jump into the next when block without testing its condition, you must use a goto.
ja: 条件をテストせずに次のwhenブロックにジャンプするにはgotoを使わなければならない。

source: To make a parameter optional, either assign a default value to the parameter in the signature:
ja: パラメータを任意にするために、シグネチャー内でデフォルト値をパラメータに割り当てます：

source: To make a slice subscript return something other than values, append an appropriate adverb to the subscript.
ja: スライス添字に値と別の何かを返させるために、添字に適切な副詞を追加してください。

source: To mark them all as handled you must access them individually via the implicit loop of a CATCH block.
ja: それらを全てハンドルされたとしてマークするためにはCATCHブロックの暗黙のループ経由で個別にアクセスしなければならない。

source: To prevent lazy lists for leaking out unexpectedly, the inside of a try is always considered an eager context, unless the try itself is in a sink context, in which case the inside of try is also in sink context.
ja: レイジーなリストが思いがけなく漏れるのを防ぐために、tryの内部は常にeagerコンテキストとみなされる。そのtry自身がsinkコンテキストでなく、tryの内部もsinkコンテキストの場合でない限り。

source: To print out the players and their scores, the code loops over @sorted, setting $n to the name of each player in turn.
ja: プレイヤーと彼らのスコアを出力するため、コードは@sortedに対してループし、$nに各々のプレイヤーの名前を次々にセットします。

source: To print player names in winner-first order, the code must sort the array by the scores of the players, not their names.
ja: 勝者順のプレイヤー名で出力するために、コードはプレイヤーの名前ではなくスコアでソートしなければなりません。

source: To process two arrays in parallel use the zip function to generate a list that can be bound to the corresponding number of parameters:
ja: 二つの配列を並行して処理するためにzip関数を使用してパラメータの数が一致するようにバインド可能なリストを生成する：

source: To return a value (to the dynamical caller) from any pointy block or bare closure, you either just let the block return the value of its final expression, or you can use leave, which comes in both function and method forms.
ja: 何か一つのポインティブロックか裸のクロージャから値を返すために（ダイナミックな呼び出し元へ）、ブロックが最後の文の値を返すようにするだけか、関数かメソッド形式のleaveを使うことができる。

source: To return from your immediate caller, you can say:
ja: あなたの呼び出し元から直接に返すなら、次のようにできる：

source: To use a role, you must incorporate it into an object, class, or, as we'll see in later chapters, a grammar.
ja: ロールを使うために、あなたはそれをオブジェクト、クラス、またはグラマー（後の章）に取り込まなければなりません。

source: Toying with the candidate list
ja: 候補リストで遊ぶ

source: Traits
ja: トレイト

source: Traits can apply implicit constraints:
ja: トレイトは暗黙の制約を適用できます：

source: Traits cannot be changed at run-time.
ja: トレイトは実行時に変更できません。

source: True if the parameter has is copy trait
ja: パラメータがis copyトレイトを持つならTrue

source: True if the parameter has is readonly trait
ja: パラメータがis readonlyトレイトを持つならTrue

source: True if the parameter has is rw trait
ja: パラメータがis rwトレイトを持つならTrue

source: True if the parameter is optional
ja: パラメータが任意ならTrue

source: True if the parameter is slurpy
ja: パラメータがslurpyならTrue

source: True if the parameter is to be passed by name
ja: パラメータが名前渡しならTrue

source: Twigils
ja: ツウィギル

source: Two bars make the regex engine try each alternative in order and the first matching alternative wins.
ja: 2つのバーは正規表現エンジンがそれぞれの選択肢を順番に試し、最初のマッチが勝つようにさせます。

source: Two objects only share the same identity if, in fact, they are the same object.
ja: 実際、それらが同じ物であるならば、2つのオブジェクトは同じ同一性を共有するだけです。

source: Type Objects
ja: 型オブジェクト

source: Type objects are undefined, in the sense that they return False if you call the .defined method on them.
ja: 型オブジェクトはundefinedです。それらに対して.definedメソッドを呼び出すとFalseを返します。

source: Types are officially compared using name equivalence rather than structural equivalence.
ja: 型は構造よりも名前の同一性を使って比較されます。

source: Types as Constraints
ja: 制約としての型

source: Underscore is always considered alphabetic.
ja: アンダースコアは常に英字とみなされます。

source: Unfortunately, dinner never magically happens.
ja: 残念なことに、夕食は決して魔法のようには出できません。

source: Unlike try, the presence of a CATCH block does not imply use fatal semantics for failures; you may, however, use either an explicit try block around the CATCH or an explicit use fatal to guarantee that failures are thrown eagerly rather than lazily.
ja: tryと違い、CATCHブロックの存在は失敗のための暗黙のuse fatalセマンティクスを行わない；あなたは多分、けれども、CATCHの周りの明示的なtryブロックか明示的なuse fatalを失敗がスローされることを保証するために使うだろう。レイジーよりも熱心に。

source: Unlike do, it evaluates the statement or block in sink (void) context; its return value is instead specified by calling the take list prefix operator one or more times within the scope (either lexical or dynamic) of the gather.
ja: doと違い、それは文またはブロックをsink（void）コンテキストで評価する；それの返り値はtakeリストプレフィックス演算子をgatherのスコープ内（レキシカルかダイナミック）で1回以上呼ぶことで代わりに明示される。

source: Unlike Perl 5's do-while loop, this is a real loop block now, so next, last, and redo work as expected.
ja: Perl 5のdo-whileループと違い、これは今実際のループブロックなので、next、last、そしてredoが期待通りに機能する。

source: Unlike in Perl 5, applying a statement modifier to a do block is specifically disallowed:
ja: Perl 5と違い、doブロックに文修飾子を適用することは明確に禁じられている：

source: Unlike in Perl 5, if a final statement in Perl 6 is a conditional that does not execute any of its branches, it doesn't matter what the value of the conditional is, the value of that conditional statement is always ().
ja: Perl 5と違い、Perl 6の最後の文が条件付きでいずれかの分岐を実行しない場合、条件の値が何かを問題とせず、その条件付き文は常に()だ。

source: Unlike in Perl 5, the notation &foo merely stands for the foo function as a Routine object without calling it.
ja: Perl 5と異なり、表記法&fooはそれを呼び出すことのないRoutineオブジェクトとして単にfoo関数を表すだけです。

source: Unlike in Perl 5, there are (by policy) no implicit blocks around standard control structures.
ja: Perl 5と異なり、標準の制御構造の周りに暗黙のブロックは（ポリシーとして）無い。

source: Unlike many other languages, Perl 6 specifies exception handlers by placing a CATCH block within that block that is having its exceptions handled.
ja: 他の言語と違い、Perl 6は扱われる例外を持つCATCHブロックをそのブロック内に配置することで例外ハンドラを明示する。

source: Unlike positional parameters, named parameters are optional by default.
ja: 位置に依存するパラメータと違い、デフォルトでは名前が付けられたパラメータは任意です。

source: Unlike signatures, captures work like references.
ja: シグネチャーと違い、キャプチャーはリファレンスのように動作します。

source: Unlike with loop controls, however, scanning a scope includes a scan of any lexical scopes included within the current candidate scope.
ja: ループ制御と違い、けれども、スコープをスキャンすることは現在の候補のスコープ内を含む何か一つのレキシカルスコープのスキャンを含む。

source: Unpacking
ja: アンパック

source: Unthrown exceptions are meant to provide a failsoft mechanism in which failures can be treated as data and dealt with one by one, without aborting execution of what may be perfectly valid parallel computations.
ja: スローされない例外はフェールソフトメカニズムを供給するように意図される。その失敗はデータとして扱うことができ、一つづつ分配できる。完璧に正しい並行計算の実行の中止なしに。

source: Usage of unknown options or too many or few arguments triggers an automatically generated usage message, which can be overridden with a custom USAGE sub:
ja: 未知のオプション、あるいは多いか少ない引数は自動的に使用法メッセージを発生させます。USAGEサブルーチンでカスタムしてオーバライドできます：

source: Use
ja: 使え

source: Use $Package::var instead.
ja: $Package::varを代わりに使ってください。

source: Use caution as this will alter the original object passed.
ja: これは渡されたオリジナルのオブジェクトを変更することになるので注意してください。

source: Use of a placeholder parameter in statement-level blocks triggers a syntax error, because the parameter is not out front where it can be seen.
ja: 文レベルのブロックでのプレースホルダーパラメータの使用は文法エラーを引き起こす。なぜならそれが見える場所でパラメータは前に出ていないからだ。

source: Use the scope declarator our to make the subroutine available within the current package, and install a lexical alias in the scope where you want to use it:
ja: サブルーチンを現在のパッケージ内で利用できるようにするにはourスコープ宣言を使ってください。そしてあなたが使いたいスコープにレキシカルなエイリアス（別名）をインストールしてください：

source: User-defined classes don't derive from Cool by default, so such classes are also unaffected by changes to Cool.
ja: デフォルトでユーザー定義のクラスはCoolから継承しないので、そのようなクラスはCoolによる変化の影響を受けません。

source: User-selected Brackets
ja: ユーザー選択のブラケット

source: Using m/ ... / in the call to subst would create a match object and pass it as the first argument, rather than the regex itself.
ja: substの呼び出しにおいてm/ ... /を使うと、正規表現自体ではなくマッチオブジェクトを作成して、それを最初の引数に渡します。

source: Using a match object as an array yields access to the positional captures.
ja: 配列としてマッチオブジェクトを使用することは、位置依存のキャプチャーにアクセスを与えます。

source: Using it as a hash reveals the named captures.
ja: ハッシュとしてそれを使うことは、名前をつけられたキャプチャーを示します。

source: Using the returns trait is, of course, always optional.
ja: もちろんreturnsトレイトの使用は、常に任意です。

source: Using the . method call operator without specifying an explicit invocant uses the current topic as the invocant.
ja: .メソッドコールを明示的なインボカントなしに呼び出すと、現在のトピックがインボカントになります。

source: Usually, when talking about regex that are rules or tokens, we tend to call them rules or tokens rather than the more general term "regex", to distinguish their special behaviors.
ja: 通常、ルールまたはトークンである正規表現について話すとき、それらの特別な振る舞いを識別するために、我々は「正規表現」という一般的な用語よりもルールまたはトークンと呼ぶ傾向があります。

source: Variable
ja: 変数

source: Variables with the @ sigil are accessed positionally; variables with the % sigil are accessed by string key.
ja: @シギルによる変数は位置的にアクセスされます；%シギルは文字列キーでアクセスされます。

source: Verify Rakudo * behavior at press time.
ja: 本のプレス時にはRakudoの振る舞いを検証してください。

source: Warnings are produced in Perl 6 by throwing a resumable control exception to the outermost scope, which by default prints the warning and resumes the exception by extracting a resume continuation from the exception, which must be supplied by the warn() function (or equivalent).
ja: Perl 6では再開可能な制御例外を最も外側のスコープに投げることで警告が引き起こされる。その警告はデフォルトで警告をプリントし、warn()関数（または同等のもの）から供給されなければならない例外から再開可能な継続取り出すことで例外を再開する。

source: We also use the term "dynamic scoping" in the standard fashion to indicate the nested call frames that are created and destroyed every time a function or method is called.
ja: 我々はまた、関数かメソッドが呼ばれるたびに作成と破棄が行われる入れ子になったコールフレームを示すために「ダイナミックスコープ」という語句を標準的な方法で使う。

source: We can't really rely on end-of-routine cleanup to deal with failures that are returned as normal data, unless we go with the overhead of a lexical @! variable.]
ja: 我々は本当に通常のデータとして返される失敗に対処するためのルーチン終了のクリーンアップを頼りにすることはできない。レキシカルな@!変数へオーバーヘッドとともに行くのでない限り。］

source: We expect some experience in another programming language, though no prior knowledge of Perl is necessary.
ja: Perlの事前知識は必要ありませんが、我々は別のプログラミング言語のいくらかの経験を想定しています。

source: We intend these examples to demonstrate how to use the features, techniques, and idioms explained in the chapter in real programs.
ja: 我々は、章で説明される実際のプログラムでこれらの例が機能、テクニックとイディオムを使用する方法を示すつもりです。

source: We should probably at least issue warnings, though, if the GC eventually collects a failure that was never handled.
ja: たぶん我々は少なくとも警告を出すべきだ。しかしながら、もしGCが結局は決してハンドルされない失敗を集めるなら。

source: We use the phrase "lexical scoping" in its industry-standard meaning to indicate those blocks that surround the current textual location.
ja: 我々は「レキシカルスコープ」という言い回しを業界標準の「現在のテキスト位置を囲んでいるブロック」を示す意味で使用する。

source: We've left them in because they might serve as useful cues for the reader as well as for us authors about what remains to be done.
ja: 読者と著者に役立つきっかけになるかもしれないので、我々はそれらを残したままにしています。

source: Well, it doesn't really fall back, since a take knows at compile time whether it is being used lexically or dynamically.
ja: さて、それは本当は戻らない。takeがレキシカルかダイナミックに使われるかどうかコンパイル時に知る時から。

source: What about AUTOMETH?
ja: AUTOMETHはどうですか？

source: What can you do if there is a conflict?
ja: 競合があるならば、あなたは何をすることができますか？

source: What happens when a class performs a role but overrides all of its methods?
ja: クラスがロールを実行するが、そのメソッドすべてをオーバーライドするとき、何が起こりますか？

source: What is i, if not sqrt(-1)?
ja: sqrt(-1)でなければ、iは何ですか？

source: What is a role?
ja: ロールとは何ですか？

source: What's the * in the bless call?
ja: blessの呼び出しの*は何でしょうか？

source: What's the difference?
ja: 違いは何ですか？

source: When subst matches, it substitutes the matched portion of the string with its the second operand:
ja: substがマッチするとき、それは文字列のマッチした部分を第2オペランドで置換します：

source: When a <value> call matches, the action method with the same symbol as the matching subrule executes.
ja: <value>がマッチを呼ぶとき、サブルールをマッチする同じシンボルのアクションメソッドを実行します。

source: When a class composes multiple roles, an alternate declaration syntax - called an also declarator - may be more readable:
ja: クラスが複数のロールを合成する場合、代わりの宣言構文 ― also宣言子と呼ばれる ― はより読みやすいです：

source: When a class inherits from another class that informs the method dispatcher to follow the inheritance chain to look for a method to dispatch.
ja: クラスがもう一つのクラスを継承するとき、それはディスパッチするためのメソッドを探すために継承チェーンを追従するようにメソッド・ディスパッチャーに知らせます。

source: When a class inherits from multiple classes the dispatcher knows to look at both classes when looking up a method to search for.
ja: クラスが複数のクラスから継承するとき、ディスパッチャーは捜すメソッドを見るときに両方のクラスを見ることを知っています。

source: When a function or method returns an object you don't know about, finding its type with .WHAT, a construction recipe for it with .perl and so on you'll get a good idea what this return value is.
ja: 関数またはメソッドがあなたの知らないオブジェクトを返すとき、.WHATでその型を見つけ、.perlでその構造を、そしてこの戻り値が何であるかという良いアイデアを得るでしょう。

source: When a subroutine has many parameters, it can become difficult for the caller to remember in what order they should pass the arguments.
ja: サブルーチンが多くのパラメータを持っているとき、呼び出し元が引数をどんな順序で渡すべきか覚えるのが難しくなります。

source: When array and hash variables appear directly in a double-quoted string (and not inside curly brackets), they are only interpolated if their name is followed by a postcircumfix -- a bracketing pair that follows a statement.
ja: 配列とハッシュ変数がダブルクォート付き文字列の中に直接表れるとき（そしてカーリーブラケットの中にない）、名前の後に後置接周辞 ― 文に続く括弧のペアがあるなら、それらは単に展開されます。

source: When both positional and named parameters are present in the same signature, all the positional parameters need to come before the named parameters.
ja: 順序に依存するものと名前付きのパラメータが両方とも同じシグネチャに存在するとき、全ての順序依存パラメータは名前付きパラメータの先にこなければなりません。

source: When bound into a lol context, however, the parcel objects become real List objects that keep their identity as discrete sublists.
ja: lolコンテキストにバインドされるとき、どんな方法でも、パーセルオブジェクトは不連続のサブリストとしてそれらの識別子を持つ本当のListオブジェクトになる。

source: When calling the rule <value>, the grammar engine attempts to match the alternatives in parallel and the longest match wins.
ja: ルール<value>を呼ぶとき、グラマーエンジンは選択肢のマッチを並列に試みます。そして最長マッチが勝ちます。

source: When followed by a number, it matches that many times.
ja: 数値が続くとき、それは複数回マッチします。

source: When followed by a range, it can match any number of times that the range allows:
ja: レンジが続くとき、レンジが許可する範囲で任意の回数マッチできます：

source: When matching m/\w+ 'en'/ against the string oxen, the \w+ group first matches the whole string because of the greediness of +, but then the en literal at the end can't match anything.
ja: 文字列oxenに対してm/\w+ 'en'/をマッチングするとき、\w+グループは+の欲張りのため、全部の文字列に最初にマッチします。しかし、終わりのリテラルのenはどんなものにもマッチすることができません。

source: When parsing a programming language you might discard whitespace characters and comments.
ja: プログラミング言語を解析するとき、あなたは空白文字とコメントを捨てるかもしれません。

source: When phasers are in different modules, the INIT and END phasers are treated as if declared at use time in the using module.
ja: phasersが異なるモジュールにある時、INITとEND phasersはモジュールを使うuse時に宣言されたかのように扱われる。

source: When reaching for multiple inheritance it is good practice to consider whether the design wouldn't be better realized by using roles, which are generally safer because they force the class author to explicitly resolve conflicting method names.
ja: デザインがロールを用いてよりよく実現されないかどうかにかかわらず、多重継承に至ることを考慮するのはよい習慣です（それらが明示的に矛盾するメソッド名を解決することをクラス作成者を強要するので、それは一般により安全です）。

source: When the right-hand side is a scalar, the item assignment operator with tight precedence is used, otherwise the loose-precedence list assignment operator is used.
ja: 右側がスカラーであるとき、タイトな優先順によるアイテム割り当て演算子が使われます。さもなければ、ゆるい優先順のリスト割り当て演算子が使われます。

source: When two array items have the same value, sort leaves them in the same order as it found them.
ja: 配列の2つのアイテムが同じ値を持つとき、sortはそれらを見つけた順にしておきます。

source: When used as statement modifiers on implicit blocks (thunks), for and given privately temporize the current value of $_ for the left side of the statement and restore the original value at loop exit:
ja: 文修飾子が暗黙のブロック（サンク）で使われるとき、forとgivenは左側の文の現在の$_の値をひそかに一時的とし、ループの終了時に初期値を復元する：

source: When using the is copy trait, only the local copy is assigned; any arguments passed to the subroutine remain unchanged in the caller's scope.
ja: is copyトレイトを使うとき、ローカルコピーだけが割り当てられます；サブルーチンに渡された引数が何であれ、呼び出し元のスコープでは不変のままです。

source: When writing generic multi routines you often want to write a bit of code whose meaning is dependent on the linguistic context of the caller.
ja: ジェネリックな複数のルーチンを書くとき、あなたはしばしば呼び出し元の言語コンテキストに意味が依存している少しのコードを書こうと思うだろう。

source: When you do so, the order in which they appear does not matter:
ja: あなたがそうするとき、それらが出現する順序は重要ではありません：

source: When you run the program, you'll see that say doesn't print the contents of that string verbatim.
ja: プログラムを実行するとき、sayは文字列の内容を文字通りには出力しないでしょう。

source: When you use an array or list as a number, it evaluates to the number of items in that list.
ja: あなたが数として配列またはリストを使うとき、それはリストのアイテムの個数と評価します。

source: Whenever an exception occurs during the execution of a handler, it is pushed onto the end of the @*undead array for later processing by an outer handler.
ja: ハンドラの実行中に例外が起こる時はいつでも、外側のハンドラに処理されて後で@*undead配列の終端にプッシュされる。

source: Whenever the compiler performs a type check on the parameter $d, it first checks the nominal type (here, Any).
ja: コンパイラがパラメータ$dの型をチェックする時はいつでも、最初に普通の型（ここではAny）をチェックします。

source: Whenever the grammar engine finishes parsing a regex, it calls a method on the actions object with the same name as the regex.
ja: グラマーエンジンが正規表現を解析し終わるときはいつでも、それは正規表現と同じ名前でactionsオブジェクトのメソッドを呼びます。

source: Whenever you write a sub-routine call, you are implicitly creating a Capture.
ja: サブルーチン呼び出しを書く時はいつでも、あなたは暗黙にCaptureを作成しています。

source: Which one is actually called depends on the type of the data passed to the subroutine.
ja: どれが実際に呼ばれるかはサブルーチンに渡されるデータ型に依存します。

source: While Perl 6 does enforce encapsulation on attributes, it also saves you from writing accessor methods.
ja: Perl 6がカプセル化を属性に強制する間、それはアクセサメソッドを記述することも安全に保ちます。

source: While attributes give objects state, methods give objects behaviors.
ja: 属性がオブジェクト状態を与える間、メソッドはオブジェクトに作用を与えます。

source: While backtracking is often useful and convenient, it can also be slow and confusing.
ja: バックトラックはしばしば役立って便利ですが、それは遅くなり混乱させます。

source: While multiple inheritance is a useful concept to know and on occasion of use, it is important to understand that there are more useful OOP concepts.
ja: 多重継承は知ると役に立つ概念です。そして使用の時に、より役に立つOOP概念があることを理解するのは重要です。

source: While regex names are completely up to the grammar writer, a regex named TOP will, by default, be invoked when the .parse() method is executed on a grammar (footnote: The name of the regex that is automatically invoked may also be specified as a parameter to .parse().
ja: 正規表現名が完全にグラマーライター次第である間、.parse()メソッドがグラマー上で実行されるとき、TOPという名前の正規表現がデフォルトで起動されます。（脚注：自動的に起動される正規表現の名前は、.parse()へのパラメータとしても指定できます。

source: While this chapter has demonstrated the numeric and string comparison operators --== and eq--there is no operator for comparing ranges.
ja: この章が数値と文字列の比較を説明する間 ― ==とeq ― レンジを比較する演算子はありません。

source: While this does not work perfectly in all cases (footnote: For example closures cannot easily be reproduced this way; if you don't know what a closure is don't worry.
ja: とは言え、これは全てのケースで完璧に動作するわけではありません（脚注：例えばクロージャはこの方法では簡単に再構築できません；あなたがクロージャについて知らなければ心配はいりません。

source: Will result in the *@words parameter having two string elements, not just a single array element.
ja: 結果として*@wordsパラメータは単独の配列要素ではなく2つの文字列要素を持ちます。

source: With .^methods you can learn what you can do with it.
ja: .^methodsで、あなたはそれをどうすることができるのかについて学ぶことができます。

source: With @a and @b as defined in the previous example, @a eqv @b is true because @a and @b contain the same values each.
ja: 前の例で定義した@aと@bで、@aと@bは各々同じ値を含むので@a eqv @bは真です。

source: With a target object or label, loop modifiers search lexotically for the scope to modify.
ja: ターゲットオブジェクトかラベルを伴って、ループ修飾子はレギゾチックに変更するスコープを検索する。

source: With no explicit type or constraint on the parameter $d, its type defaults to Any--and thus it matches any passed object.
ja: 明確な型またはパラメータ$dへの制約なしで、Anyへのその型デフォルト ― したがって、それは渡されたどんなオブジェクトにもマッチします。

source: Within a lift, special rules apply to how names are looked up.
ja: lift内では、どのように名前を調べるか特別なルールが適用される。

source: Within a regex, the syntax <&word> locates the regex word within the current lexical scope and matches against the regex.
ja: 正規表現の中で、構文<&word>は現在のレキシカルスコープの中で正規表現wordを見つけて、正規表現に対してマッチします。

source: Within the if block, $<<dup> is short for $/{'dup'}.
ja: ifブロックの中で、$<<dup>は$/{'dup'}の省略です。

source: Within the if block, $<dup> is short for $/{'dup'}.
ja: ifブロックの中で、$<dup>は$/{'dup'}の省略です。

source: Without a target, however, they are purely dynamic, and choose the innermost dynamic loop, which may well be a map or other implicitly looping function, including user-defined functions.
ja: ターゲットなしで純粋に動的ならなんであれ、最も深い部分の動的ループを選ぶ。それはmapまたは他の暗黙のユーザー定義の関数を含むループ関数だ。

source: Without the first word boundary anchor, the regex would for example match strand and beach or lathe the table leg.
ja: 最初の単語境界アンカーなしでは、例の正規表現はstrand and beachまたはlathe the table legにマッチします。

source: Without the last word boundary anchor it would also match the theory.
ja: 最後のアンカーなしではthe theoryにもマッチします。

source: Working With Types
ja: 型で作業する

source: Writing a fractional value with a dot as the decimal separator, such as 3.14, produces a Rat.
ja: 小数点（例えば3.14）としてドットで小数値を書くことはRatを生み出します。

source: You already know that the three-argument version and the four-argument version have different candidates: the latter binds its first argument as rw:
ja: あなたは、3引数版と4引数版が異なる候補を持っているということをすでに知っています：後者は、rwとしてその最初の引数を結びつけます：
